# Бонусное домашнее задание (pandas).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [9]:
import pandas as pd
a1 = []
a2 = []
for i in range(10):
    s1 = "Students_info_" + str(i) + ".csv"
    # s2 = "../Data/Students_marks_" + str(i)
    a1.append(pd.read_csv(s1))
    s2 = "Students_marks_" + str(i) + ".csv"
    a2.append(pd.read_csv(s2))
df1 = pd.concat(a1, ignore_index=True)
df2 = pd.concat(a2, ignore_index=True)
# df1.head()
# df2.head()
df = pd.merge(df1, df2, how = 'outer', on = 'index')
print(df.shape)
df.head()

(1000, 10)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [10]:
df = df.drop('index', axis=1)

In [11]:
df.iloc[:10]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [12]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [13]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [14]:
df.isnull().values.any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [23]:
print(df['math score'].mean(), df['reading score'].mean(), df['writing score'].mean())

66.089 69.169 68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [22]:
print(df.groupby("test preparation course")['math score'].apply(lambda x: x.mean()), end = '\n\n')
print(df.groupby("test preparation course")['reading score'].apply(lambda x: x.mean()), end = '\n\n')
print(df.groupby("test preparation course")['writing score'].apply(lambda x: x.mean()))

test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64

test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64

test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [24]:
set(df["lunch"])

{'free/reduced', 'standard'}

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [25]:
df.rename(columns = {'parental level of education': 'education'}, inplace = True)
df.rename(columns = {'test preparation course': 'test preparation'}, inplace = True)

In [26]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [27]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [28]:
((df['math score'] >= passmark).astype(int)).mean()

0.865

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [29]:
%%time
print(df.groupby("race/ethnicity")['reading score'].apply(lambda x : x.mean()), end = '\n\n')
print(df.groupby("education")['writing score'].apply(lambda x : x.min()))

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 19 ms

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [30]:
%%time
sm = {}
cn = {}
n = len(df['reading score'])
for i in range(len(df['reading score'])):
    race = df['race/ethnicity'][i]
    sc = int(df['reading score'][i])
    if race in sm:
        sm[race] += sc
    else :
        sm[race] = sc
    if race in cn:
        cn[race] += 1
    else :
        cn[race] = 1
ser1 = pd.Series(data=sm)
ser2 = pd.Series(data=cn)
res = ser1/ser2
print(res.sort_values(), end = "\n\n")

sm = {}
n = len(df['writing score'])
for i in range(len(df['writing score'])):
    race = df['education'][i]
    sc = int(df['writing score'][i])
    if race in sm:
        sm[race] = min(sm[race], sc)
    else :
        sm[race] = sc
ser1 = pd.Series(data=sm)
print(ser1.sort_index(), end = "\n\n")

group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
dtype: float64

associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
dtype: int64

CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 201 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [31]:
import numpy as np

pd.pivot_table(df, index=['gender', 'education'], values=['reading score'], aggfunc=np.mean)

                           reading score
gender education
female associate's degree      74.120690
       bachelor's degree       77.285714
       high school             68.202128
       master's degree         76.805556
       some college            73.550847
       some high school        69.109890
male   associate's degree      67.433962
       bachelor's degree       68.090909
       high school             61.480392
       master's degree         73.130435
       some college            64.990741
       some high school        64.693182

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [32]:
df['Math_PassStatus'] = df['math score'].apply(lambda x : 'F' if x < passmark else 'T')
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,T
1,female,group C,some college,standard,completed,group1,69,90,88,T
2,female,group B,master's degree,standard,none,group1,90,95,93,T
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F
4,male,group C,some college,standard,none,group1,76,78,75,T

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [50]:
# df[] = df['math score', 'reading score', 'writing score'].apply(lambda x : 'F')
df.head()
def f(ms, rs, ws):
    if ms < passmark or rs < passmark or ws < passmark:
        return 'F'
    return 'T'
df['OverAll_PassStatus'] = df.apply(lambda x: f(x['math score'], x['reading score'], x['writing score']), axis=1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Grade,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,T,T
1,female,group C,some college,standard,completed,group1,69,90,88,T,T
2,female,group B,master's degree,standard,none,group1,90,95,93,T,T
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,F
4,male,group C,some college,standard,none,group1,76,78,75,T,T

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    90 и больше = A
####      [80;90) = B
####      [70;80) = C
####      [60;70) = D
####      [50;60) = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [55]:
def GetGrade(average_mark):
    if average_mark >= 90:
        return 'A' 
    if average_mark >= 80:
        return 'B'
    if average_mark >= 70:
        return 'C'
    if average_mark >= 60:
        return 'D'
    if average_mark >= 50:
        return 'E'
    return 'F'
df['Grade'] = df.apply(lambda x: GetGrade((x['math score'] + x['reading score'] + x['writing score'])/3), axis=1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,C
1,female,group C,some college,standard,completed,group1,69,90,88,B
2,female,group B,master's degree,standard,none,group1,90,95,93,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F
4,male,group C,some college,standard,none,group1,76,78,75,C